export const vocab = {
    // # Специальные токены
    0: '[PAD]',   //# Для выравнивания длин последовательностей
    1: '[BOS]',   //# Начало последовательности
    2: '[EOS]',   //# Конец последовательности
    3: '[UNK]',   //# Неизвестный символ
    
    // # Символы предварительной обработки текста
    4: ' ',       //# Пробел
    5: '\n',      //# Перевод строки
    
    // # Знаки препинания
    6: '.', 7: ',', 8: '!', 9: '?', 10: ';', 11: ':', 12: '"', 13: "'", 
    14: '(', 15: ')', 16: '-', 17: '—', 18: '…',
    
    // # Цифры
    19: '0', 20: '1', 21: '2', 22: '3', 23: '4',
    24: '5', 25: '6', 26: '7', 27: '8', 28: '9',
    
    // # Русские буквы (строчные)
    29: 'а', 30: 'б', 31: 'в', 32: 'г', 33: 'д', 34: 'е', 35: 'ё', 36: 'ж', 
    37: 'з', 38: 'и', 39: 'й', 40: 'к', 41: 'л', 42: 'м', 43: 'н', 44: 'о', 
    45: 'п', 46: 'р', 47: 'с', 48: 'т', 49: 'у', 50: 'ф', 51: 'х', 52: 'ц', 
    53: 'ч', 54: 'ш', 55: 'щ', 56: 'ъ', 57: 'ы', 58: 'ь', 59: 'э', 60: 'ю', 
    61: 'я',
    
    // # Русские буквы (заглавные)
    62: 'А', 63: 'Б', 64: 'В', 65: 'Г', 66: 'Д', 67: 'Е', 68: 'Ё', 69: 'Ж',
    70: 'З', 71: 'И', 72: 'Й', 73: 'К', 74: 'Л', 75: 'М', 76: 'Н', 77: 'О',
    78: 'П', 79: 'Р', 80: 'С', 81: 'Т', 82: 'У', 83: 'Ф', 84: 'Х', 85: 'Ц',
    86: 'Ч', 87: 'Ш', 88: 'Щ', 89: 'Ъ', 90: 'Ы', 91: 'Ь', 92: 'Э', 93: 'Ю',
    94: 'Я',
    
    // # Дополнительные символы для русского текста
    95: '%', 96: '/', 97: '\\', 98: '«', 99: '»', 100: '–'
}